Revit 2026 API

# ApplicationCities Property

---

Returns a set of all the known city locations within Revit.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CitySet Cities { get; }
```
```vb
Public ReadOnly Property Cities As CitySet
	Get
```
```cpp
public:
property CitySet^ Cities {
	CitySet^ get ();
}
```
```fsharp
member Cities : CitySet with get
```

#### Property Value

CitySet

Each city has information about longitude, latitude etc.

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace